app/Controllers/Main.php

    public function search()
    {
        $data = [];

        //Get search item
        $search_term = $this->request->getPost('text_search');

        //
        $task_model = new TasksModel();
        $data['tasks'] = $task_model->where('id_user', session()->id)->like('task_name', $search_term)->findAll();
---
SELECT *
FROM `tasks`
WHERE `id_user` = '3'
AND  `task_name` LIKE '%tarfea%' ESCAPE '!'