app/Controllers/Main.php

    public function index()
    {
        $data = [];

        // load data from database with the user in session
        $task_model = new TasksModel();
        $data['tasks'] = $task_model->where('id_user', session()->id)->findAll();
---
SELECT *
FROM `tasks`
WHERE `id_user` = '3'

    public function login_submit()
    {
        // Form validation
        $validation = $this->validate(
            // Validation rules
            [
                'text_utilizador' => 'required',
                'text_password' => 'required'
            ],
            // Validation errors
            [
                'text_utilizador' => [
                    'required' => 'O campo utilizador é obrigatório'
                ],
                'text_password' => [
                    'required' => 'O campo password é obrigatório'
                ]
            ]
        );

        if (!$validation) {
            return redirect()->to('/login')->withInput()->with('validation_errors', $this->validator->getErrors());
        }

        // get form data
        $user = $this->request->getPost('text_utilizador');
        $passwrd = $this->request->getPost('text_password');

        // Check if login is valid
        $utilizadores_model = new UtilizadoresModel();
        $user_data = $utilizadores_model->where('utilizador', $user)->first();
---
SELECT *
FROM `utilizadores`
WHERE `utilizador` = 'user3'
 LIMIT 1

    public function edit_task($enc_id)
    {
        // decrypt task id
        $task_id = decrypt($enc_id);
        if (!$task_id) {
            return redirect()->to('/');
        }

        $data = [];

        $validation_errors = session()->getFlashdata('validation_errors');
        if ($validation_errors) {
            $data['validation_errors'] = $validation_errors;
        }

        // load task data
        $task_model = new TasksModel();
        $task_data = $task_model->where('id', $task_id)->first();
---
SELECT *
FROM `tasks`
WHERE `id` = '9'
 LIMIT 1

    public function delete_task($enc_id)
    {
        // decrypt task id
        $id_task = decrypt($enc_id);
        if (!$id_task) {
            return redirect()->to('/');
        }

        $data = [];

        //load data from database
        $task_model = new TasksModel();
        $task_data = $task_model->where('id', $id_task)->first();
---
SELECT *
FROM `tasks`
WHERE `id` = '7'
 LIMIT 1